using System;
// 1. Напишете програма, която да проверява дали въведното число от потребителя е четно или нечетно. 
//    Ако числото е 0-ла съобщението трябва да бъде,че числото 0-ла не е нито четно, нито нечетно.
// 2. Напишете програма, която показва знака (+ или -) от частното на две реални числа, без да го пресмята.
// 3. Напишете програма, която намира по-голямото от две дадени числа.
// 4. Напишете програма, която намира най-голямото от три дадени числа.
// 5. Напишете програма, която взема дадена цифра (0-9) и я изписва с дума (на англ. език)
// 6. Напишете програма, която приема три цели числа. Изведете на конзолата дали може да бъде бъде образуван триъгълник с дължини на страните  от въведените три числа.

// 7. Напишете програма, която изчислява бонус точки на база резултат от игра. 
// Потребителят трябва да въведе своите точни в интервалa[1;9]. 
// Ако точките са в интервала [1;3], умножете ги по 5. Ако точките са в интервала [4;6], умножете ги по 10. 
// Ако точките са в интервала [7;9], умножете ги по 50. Резултатът изведете на екрана.
namespace LoopsUI
{
    class LoopsUI
    {
        static void Main(string[] args)
        {
            ValueValidation(GetValue());
            
        }

        public static int GetValue()
        {
            int number;
            Console.Write("Input a integer value: ");
            number = Convert.ToInt32(Console.ReadLine());
            return number;
        }

        private static int ValueValidation(int value)
        {
            if(value == 0)
            {
                Console.WriteLine("The number 0 is not even either odd.");
            }

            else if (value % 2 == 0)
            {
                Console.WriteLine("even");
            }

            else
            {
                Console.WriteLine("odd.");
            }

            return value;
        }

        //TODO Task 2, 3, 4, 5, 6, 7
    }
}
